
# ---------------------------------------------------------
# ۲. کانفیگ اصلاح‌شده با مختصات‌های دقیق‌تر
#  برای هر crop میشه یه resize منحصربه فرد بدیم ---------------------------------------------------------

CONFIG = {
    "name":               {"roi": (0.3273, 0.367, 0.5407, 0.8975), "lang": "fa", "type": "text","dictionary":None},
    "name_father":        {"roi": (0.3205, 0.3541, 0.2963, 0.4165), "lang": "fa", "type": "text","dictionary":None},
    "تاریخ_تولد":         {"roi": (0.3522, 0.4098, 0.6598, 0.7943), "lang": "fa", "type": "date","dictionary":None},
    "شماره شناسنامه":     {"roi": (0.3938, 0.4374, 0.6733, 0.7567), "lang": "fa", "type": "numeric","dictionary":None},
    "شماره ملی":          {"roi": (0.3889, 0.4346, 0.2694, 0.3924), "lang": "fa", "type": "numeric","dictionary":None},
    "شماره پلاک":         {"roi": (0.4286, 0.4862, 0.1357, 0.3382), "lang": "fa", "type": "plate","dictionary":None},
    "کدپستی":             {"roi": (0.4294, 0.4702, 0.6574, 0.805), "lang": "fa", "type": "numeric","dictionary":None},
    "Addres":             {"roi": (0.4722, 0.503, 0.1701, 0.8892), "lang": "fa", "type": "text","dictionary":None},
    "نوع":                {"roi": (0.2084, 0.2381, 0.7472, 0.8975), "lang": "fa", "type": "text","dictionary":None},
    "سیستم":              {"roi": (0.2073, 0.2332, 0.5479, 0.7108), "lang": "fa", "type": "text","dictionary":None},
    "تیپ":                {"roi": (0.2104, 0.2352, 0.3821, 0.5479), "lang": "fa", "type": "text","dictionary":None},
    "مدل":                {"roi": (0.2124, 0.2361, 0.2286, 0.354), "lang": "fa", "type": "numeric","dictionary":None},
    "رنگ":                {"roi": (0.2005, 0.2361, 0.0763, 0.2401), "lang": "fa", "type": "text","dictionary":"colors"},  # مختصات رنگ اصلاح شد
    "موتور":              {"roi": (0.2501, 0.2737, 0.5542, 0.856), "lang": "en", "type": "code","dictionary":None},
    "شماره_شاسی":         {"roi": (0.2521, 0.2709, 0.2318, 0.4719), "lang": "en", "type": "code","dictionary":None},
    "VIN":                {"roi": (0.2689, 0.3017, 0.2413, 0.7619), "lang": "en", "type": "code","dictionary":None},  # مختصات VIN اصلاح شد
    "شماره_سند":          {"roi": (0.0208, 0.0596, 0.0763, 0.2536), "lang": "fa", "type": "numeric","dictionary":None},
    "شماره برگ سبز":      {"roi": (0.3174, 0.4622, 0.0669, 0.123), "lang": "fa", "type": "numeric","dictionary":None}
}


# ---------------------------------------------------------
#  دیکشنری تبدیل کاراکترهای Presentation Forms به حروف استاندارد فارسی
# ---------------------------------------------------------



PRESENTATION_FORMS_MAP = {
    'ﺁ': 'آ', 'ﺂ': 'آ', 'ﺃ': 'أ', 'ﺄ': 'أ', 'ﺇ': 'إ', 'ﺈ': 'إ',
    'ﺍ': 'ا', 'ﺎ': 'ا', 'ﺏ': 'ب', 'ﺐ': 'ب', 'ﺑ': 'ب', 'ﺒ': 'ب',
    'ﭖ': 'پ', 'ﭗ': 'پ', 'ﭘ': 'پ', 'ﭙ': 'پ', 'ﺕ': 'ت', 'ﺖ': 'ت',
    'ﺗ': 'ت', 'ﺘ': 'ت', 'ﺙ': 'ث', 'ﺚ': 'ث', 'ﺛ': 'ث', 'ﺜ': 'ث',
    'ﺝ': 'ج', 'ﺞ': 'ج', 'ﺟ': 'ج', 'ﺠ': 'ج', 'ﭺ': 'چ', 'ﭻ': 'چ',
    'ﭼ': 'چ', 'ﭽ': 'چ', 'ﺡ': 'ح', 'ﺢ': 'ح', 'ﺣ': 'ح', 'ﺤ': 'ح',
    'ﺥ': 'خ', 'ﺦ': 'خ', 'ﺧ': 'خ', 'ﺨ': 'خ', 'ﺩ': 'د', 'ﺪ': 'د',
    'ﺫ': 'ذ', 'ﺬ': 'ذ', 'ﺭ': 'ر', 'ﺮ': 'ر', 'ﺯ': 'ز', 'ﺰ': 'ز',
    'ﮊ': 'ژ', 'ﮋ': 'ژ', 'ﺱ': 'س', 'ﺲ': 'س', 'ﺳ': 'س', 'ﺴ': 'س',
    'ﺵ': 'ش', 'ﺶ': 'ش', 'ﺷ': 'ش', 'ﺸ': 'ش', 'ﺹ': 'ص', 'ﺺ': 'ص',
    'ﺻ': 'ص', 'ﺼ': 'ص', 'ﺽ': 'ض', 'ﺾ': 'ض', 'ﺿ': 'ض', 'ﻀ': 'ض',
    'ﻁ': 'ط', 'ﻂ': 'ط', 'ﻃ': 'ط', 'ﻄ': 'ط', 'ﻅ': 'ظ', 'ﻆ': 'ظ',
    'ﻇ': 'ظ', 'ﻈ': 'ظ', 'ﻉ': 'ع', 'ﻊ': 'ع', 'ﻋ': 'ع', 'ﻌ': 'ع',
    'ﻍ': 'غ', 'ﻎ': 'غ', 'ﻏ': 'غ', 'ﻐ': 'غ', 'ﻑ': 'ف', 'ﻒ': 'ف',
    'ﻓ': 'ف', 'ﻔ': 'ف', 'ﻕ': 'ق', 'ﻖ': 'ق', 'ﻗ': 'ق', 'ﻘ': 'ق',
    'ﻙ': 'ک', 'ﻚ': 'ک', 'ﻛ': 'ک', 'ﻜ': 'ک', 'ﮎ': 'ک', 'ﮏ': 'ک',
    'ﮐ': 'ک', 'ﮑ': 'ک', 'ﮒ': 'گ', 'ﮓ': 'گ', 'ﮔ': 'گ', 'ﮕ': 'گ',
    'ﻝ': 'ل', 'ﻞ': 'ل', 'ﻟ': 'ل', 'ﻠ': 'ل', 'ﻡ': 'م', 'ﻢ': 'م',
    'ﻣ': 'م', 'ﻤ': 'م', 'ﻥ': 'ن', 'ﻦ': 'ن', 'ﻧ': 'ن', 'ﻨ': 'ن',
    'ﻭ': 'و', 'ﻮ': 'و', 'ﻩ': 'ه', 'ﻪ': 'ه', 'ﻫ': 'ه', 'ﻬ': 'ه',
    'ﯼ': 'ی', 'ﯽ': 'ی', 'ﯾ': 'ی', 'ﯿ': 'ی', 'ﻱ': 'ی', 'ﻲ': 'ی',
    'ﻳ': 'ی', 'ﻴ': 'ی', 'ﺋ': 'ئ', 'ﺌ': 'ئ', 'ﺀ': 'ء'
}